background/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 8.1505e-06;//0.1;

boundaryField
{
    inlet
    {
	    type            zeroGradient;
    }
    
    outlet
    {
	    type            zeroGradient;
    }

    walls
    {
	    type           slip;
    }
   
    ground
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 8.1505e-06;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 8.1505e-06;
        value           uniform 8.1505e-06;
    }

    floatingObject
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 8.1505e-06;
    }

    overset
    {
        type            overset;
    }

    sides
    {
        type            overset;
    }
}



// ************************************************************************* //
