background/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    inlet
    {
	    type            zeroGradient;
    }
    
    outlet
    {
	    type            zeroGradient;
    }

    walls
    {
	    type           slip;
    }
   
    ground
    {
        type            kqRWallFunction;
        value           uniform 0.00135;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.00135;
        value           uniform 0.00135;
    }

    floatingObject
    {
        type            kqRWallFunction;
        value           uniform 0.00135;
    }

    overset
    {
        type            overset;
    }

    sides
    {
        type            overset;
    }
}



// ************************************************************************* //
