background/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	    type            fixedFluxPressure;
	    value           uniform 0;
    }
    
    outlet
    {
	    type            fixedFluxPressure;
	    value           uniform 0;
    }

    walls
    {
	    type            fixedFluxPressure;
	    value           uniform 0;
    }
   
    ground
    {
	    type            fixedFluxPressure;
	    value           uniform 0;
    }

    atmosphere
    {
	    type            totalPressure;
	    p0              uniform 0;
    }

    floatingObject
    {
	    type            fixedFluxPressure;
    }

    overset
    {
        type            overset;
    }

    sides
    {
        patchType            overset;
        type                 fixedFluxPressure;  
    }
}


// ************************************************************************* //
