background/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
	    type            fixedValue;
	    value           uniform (0 0 0);
    }
    
    outlet
    {
	    type            fixedValue;
	    value           uniform (0 0 0);
    }

    walls
    {
	    type            fixedValue;
	    value           uniform (0 0 0);
    }
   
    ground
    {
	    type            fixedValue;
	    value           uniform (0 0 0);
    }

    atmosphere
    {
	    type            fixedValue;
	    value           uniform (0 0 0);
    }

    floatingObject
    {
	    type            calculated;
	    value           uniform (0 0 0);
    }

    overset
    {
	    patchType       overset;
	    type            zeroGradient;
    }

    sides
    {
        patchType       overset;
        type            zeroGradient;
    }
}

// ************************************************************************* //
