background/0.orig/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	    type            zeroGradient;
    }
    
    outlet
    {
	    type            zeroGradient;
    }

    walls
    {
	    type            zeroGradient;
    }
   
    ground
    {
	    type            zeroGradient;
    }

    atmosphere
    {
	    type            zeroGradient;
    }

    floatingObject
    {
	    type            zeroGradient;
    }

    overset
    {
	    type            overset;
    }

    sides
    {
	    type            overset;
    }
}


// ************************************************************************* //
