background/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (overset fvMotionSolvers);

application     overInterDyMFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         10;

deltaT          0.01;

writeControl    adjustable;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           2.0;

maxAlphaCo      2.0;

maxDeltaT       1;

functions
{
    freeSurface
    {
        type            surfaces;
        libs            (sampling);

        // Name of the directory for probe data
        //name            probes;

        // Write at same frequency as fields
        writeControl    outputTime;
	outputInterval 1;
	surfaceFormat stl;
	interpolationScheme cellPoint;
        surfaces
	(
		topFreeSurface
		{
			type isoSurface;
			isoField alpha.water;
			isoValue 0.5;
			interpolate true;
		}
        );
        // Fields to be probed
        fields          (alpha.water);

        // Optional: interpolation scheme to use (default is cell)
        //interpolationScheme cell;

        //probeLocations
        //(
        //    (0.00132  0.0009 0.005)
        //);
    }

    alphaVol
    {
        // Mandatory entries
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        fields          (alpha.water);
        operation       volIntegrate;
        regionType      all;

        // Optional entries
        postOperation   none;
        // Write at same frequency as fields
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             true;
    }
  #includeFunc residuals
}


// ************************************************************************* //
